Revit 2024 API
WireTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireTypeSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As WireTypeSetIterator
Visual C++
public:
virtual WireTypeSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace